In [99]:
import numpy as np
import pandas as pd

In [106]:
with open('제주,서귀포시도로침수우려지역좌표.txt', 'rt', encoding='UTF8') as f:
    df=pd.DataFrame(f)

In [107]:
df.head()

                                                  0
0                                  한림읍 대림리 1920-1\n
1  사형제횟집 뒤(L=90M)\t\tX :126.266196, Y :33.4220357\n
2                                                \n
3                                    한림읍 대림리 1431\n
4  인접도로(L=150M)\t\t\tX :126.275427, Y :33.4226400\n

In [108]:
df[0]=df[0].str.replace('\n','')

In [109]:
df.head()

                                                0
0                                  한림읍 대림리 1920-1
1  사형제횟집 뒤(L=90M)\t\tX :126.266196, Y :33.4220357
2
3                                    한림읍 대림리 1431
4  인접도로(L=150M)\t\t\tX :126.275427, Y :33.4226400

In [110]:
df=df[df[0].str.contains('X')]

In [113]:
df=df.reset_index().drop('index',axis=1)

In [114]:
df.head()

                                                 0
0   사형제횟집 뒤(L=90M)\t\tX :126.266196, Y :33.4220357
1   인접도로(L=150M)\t\t\tX :126.275427, Y :33.4226400
2   인접도로(L=100M)\t\t\tX :126.273895, Y :33.4220270
3   인접도로(L=100M)\t\t\tX :126.251187, Y :33.4032470
4  애월씨앤스타 앞(L=70M)\t\tX :126.313658, Y :33.4650790

In [115]:
splitval=df[0].str.find('X').values

In [116]:
splitval

array([16, 15, 15, 15, 17, 16, 23, 19, 10, 11, 11, 22, 11, 21, 18, 21, 13,
       15, 20, 24, 16, 16, 19, 18, 20, 21, 18, 17,  9, 13, 17, 16, 15, 17,
       18, 18, 18, 15, 14, 11,  9, 24, 23,  7, 10, 19, 17, 24, 26, 16, 15,
       21, 17, 23, 21, 16, 20, 21, 10, 12,  8,  8,  8,  8, 24,  7,  8,  8,
       26, 19, 20, 21, 21, 21, 19, 20, 21], dtype=int64)

In [119]:
lst=[]

for i in range(len(splitval)):
    lst.append(df[0][i][splitval[i]:])

In [120]:
df[0]=lst

In [124]:
df_2=df[df[0].str.contains('~')]

In [127]:
df_2

                                                    0
11  X :126.845785, Y :33.5235370 ~ X :126.847423, ...
18  X :126.317522, Y :33.9452718 ~ X :126.318214, ...
19  X :126.328487, Y :33.9456478 ~ X :126.328668, ...
38  X :126.554343, Y :33.4952662 ~ X :126.555627, ...

In [128]:
df=df.drop(df_2.index,axis=0)

In [129]:
df[0]=df[0].str.replace('X :','').str.replace('Y :','')
df_2[0]=df_2[0].str.replace('X :','').str.replace('Y :','')

C:\Users\ggyo0\AppData\Local\Temp\ipykernel_10492\721645031.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_2[0]=df_2[0].str.replace('X :','').str.replace('Y :','')

In [132]:
df[0]=df[0].str.split(',')

In [134]:
df

                            0
0   [126.266196,  33.4220357]
1   [126.275427,  33.4226400]
2   [126.273895,  33.4220270]
3   [126.251187,  33.4032470]
4   [126.313658,  33.4650790]
..                        ...
72  [126.510791,  33.2758136]
73  [126.610626,  33.2445656]
74  [126.393882,  33.2659654]
75  [126.565031,  33.2452705]
76  [126.605930,  33.2628267]

[73 rows x 1 columns]

In [141]:
df=df.reset_index().drop('index',axis=1)

In [142]:
df_2=df_2.reset_index().drop('index',axis=1)

In [143]:
from tqdm import tqdm

key=['lng','lat']
lng_lst=[]
lat_lst=[]

for i in tqdm(range(df.shape[0])):
    lng_lst.append(df[0][i][0])
    lat_lst.append(df[0][i][1])

100%|██████████| 73/73 [00:00<00:00, 36402.83it/s]

In [144]:
df

                            0
0   [126.266196,  33.4220357]
1   [126.275427,  33.4226400]
2   [126.273895,  33.4220270]
3   [126.251187,  33.4032470]
4   [126.313658,  33.4650790]
..                        ...
68  [126.510791,  33.2758136]
69  [126.610626,  33.2445656]
70  [126.393882,  33.2659654]
71  [126.565031,  33.2452705]
72  [126.605930,  33.2628267]

[73 rows x 1 columns]

In [145]:
df_new1=pd.DataFrame(dict(zip(key,[lng_lst,lat_lst])))

In [146]:
df_new1

           lng          lat
0   126.266196   33.4220357
1   126.275427   33.4226400
2   126.273895   33.4220270
3   126.251187   33.4032470
4   126.313658   33.4650790
..         ...          ...
68  126.510791   33.2758136
69  126.610626   33.2445656
70  126.393882   33.2659654
71  126.565031   33.2452705
72  126.605930   33.2628267

[73 rows x 2 columns]

In [155]:
df_2[0]=df_2[0].str.split('~')

                                                   0
0  [126.845785, 33.5235370 ,  126.847423, 33.5222...
1  [126.317522, 33.9452718 ,  126.318214, 33.9452...
2  [126.328487, 33.9456478 ,  126.328668, 33.9460...
3  [126.554343, 33.4952662 ,  126.555627, 33.4926...

In [168]:
df_2[0][0][0].replace(' ','').split(',')

['126.845785', '33.5235370']

In [170]:
df_2
key=['maxlng','minlng','maxlat','minlat']
maxlg=[]
maxlt=[]
minlg=[]
minlt=[]

for i in range(len(df_2)):
    minlng,minlat=df_2[0][i][0].replace(' ','').split(',')
    maxlng,maxlat=df_2[0][i][1].replace(' ','').split(',')
    maxlg.append(maxlng)
    maxlt.append(maxlat)
    minlg.append(minlng)
    minlt.append(minlat)

In [172]:
df_new2=pd.DataFrame(dict(zip(key,[minlt,maxlt,minlg,maxlg])))

In [176]:
df_new2['maxlat'][0]

'126.845785'

In [177]:
df_new2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   maxlng  4 non-null      object
 1   minlng  4 non-null      object
 2   maxlat  4 non-null      object
 3   minlat  4 non-null      object
dtypes: object(4)
memory usage: 256.0+ bytes

In [179]:
df_new2['maxlng']=df_new2['maxlng'].str[:6]
df_new2['minlng']=df_new2['minlng'].str[:6]

df_new2['maxlat']=df_new2['maxlat'].str[:7]
df_new2['minlat']=df_new2['minlat'].str[:7]

In [181]:
df_new2.columns=['maxlat','minlat','maxlng','minlng']

In [182]:
df_new2

   maxlat  minlat   maxlng   minlng
0  33.523  33.522  126.845  126.847
1  33.945  33.945  126.317  126.318
2  33.945  33.946  126.328  126.328
3  33.495  33.492  126.554  126.555

In [194]:
df2_lat_lst=[]
df2_lng_lst=[]

for i in range(len(df_new2)):
    maxlat=float(df_new2['maxlat'][i])
    minlat=float(df_new2['minlat'][i])
    maxlng=float(df_new2['maxlng'][i])
    minlng=float(df_new2['minlng'][i])
    if maxlat>=minlat:
        for lat in np.arange(minlat,maxlat+.001,.001):
            if maxlng>=minlng:
                for lng in np.arange(minlng,maxlng+.001,.001):
                    df2_lat_lst.append(lat)
                    df2_lng_lst.append(lng)
            else:
                for lng in np.arange(maxlng,minlng+.001,.001):
                    df2_lat_lst.append(lat)
                    df2_lng_lst.append(lng)

    else:
        for lat in np.arange(maxlat,minlat+.001,.001):
            if maxlng>=minlng:
                for lng in np.arange(minlng,maxlng+.001,.001):
                    df2_lat_lst.append(lat)
                    df2_lng_lst.append(lng)
            else:
                for lng in np.arange(maxlng,minlng+.001,.001):
                    df2_lat_lst.append(lat)
                    df2_lng_lst.append(lng)

In [198]:
key=['lng','lat']

df_new2=pd.DataFrame(dict(zip(key,[df2_lng_lst,df2_lat_lst])))

In [203]:
df_final=pd.concat([df_new1,df_new2]).reset_index().drop('index',axis=1)

In [208]:
df_final['lng']=df_final['lng'].astype(str).str.replace(' ','').str[:7]
df_final['lat']=df_final['lat'].astype(str).str.replace(' ','').str[:6]

In [209]:
df_final

         lng     lat
0    126.266  33.422
1    126.275  33.422
2    126.273  33.422
3    126.251  33.403
4    126.313  33.465
..       ...     ...
99   126.555  33.493
100  126.556  33.493
101  126.554  33.494
102  126.555  33.494
103  126.556  33.494

[104 rows x 2 columns]

In [210]:
df_final.to_csv('../chimsoo.csv',index=None)